{
  "backend/main.mo": "Motoko actor defining Event type and CRUD operations (create, get, update, delete, getAllEvents) with in-memory Map storage and date/time-based sorting.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Home screen, calendar views, event CRUD, settings) to source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files including pages, components, hooks, utilities, and configuration files.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS variables for light and dark themes including primary, secondary, muted, destructive, and chart colors.",
  "frontend/index.html": "HTML entry point with mobile-optimized meta tags, PWA capabilities, theme color configuration, and app icon references.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with six routes (Home, Calendar, AddEvent, EventDetails, EventEdit, Settings), ThemeProvider, Toaster, and notification hook initialization.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four tabs (Home, Calendar, Add, Settings) using Lucide icons and active state highlighting based on current route.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable AlertDialog component for confirmations with customizable title, description, action buttons, and loading state support.",
  "frontend/src/components/DailyView.tsx": "Daily calendar view displaying all events for selected date in chronological order with day navigation controls, today indicator, and empty state handling.",
  "frontend/src/components/EventForm.tsx": "A reusable form component for creating and editing events with fields for title, description, date, time, and reminder toggle, including validation and error handling.",
  "frontend/src/components/Layout.tsx": "A layout wrapper component that provides consistent page structure with a container, padding, and a bottom navigation bar.",
  "frontend/src/components/MonthlyView.tsx": "Displays a calendar month grid with navigation controls, highlights days with events, and shows a list of events for the selected date.",
  "frontend/src/components/WeeklyView.tsx": "Displays a week view with navigation controls, showing each day as a card with its events sorted by time, highlighting the current day.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides theme context for light/dark mode switching with localStorage persistence and system preference detection.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration and identity management.",
  "frontend/src/hooks/useNotifications.ts": "Monitors events and triggers browser notifications 15 minutes before events with reminders enabled, requesting permission if needed.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on events (get all, get one, create, update, delete) using the ICP actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a blue/purple color theme for both light and dark modes, plus base styles and animation utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AddEvent.tsx": "Page component for creating new events using EventForm, handles submission with createEvent mutation and navigates to home on success.",
  "frontend/src/pages/Calendar.tsx": "Calendar page with tabbed interface switching between monthly, weekly, and daily views, managing selected date state.",
  "frontend/src/pages/EventDetails.tsx": "Event details page displaying full event information with edit and delete actions, includes confirmation dialog for deletion.",
  "frontend/src/pages/EventEdit.tsx": "Event editing page that loads existing event data and uses EventForm to handle updates via updateEvent mutation.",
  "frontend/src/pages/Home.tsx": "Home dashboard showing greeting, today's event count, and a sorted list of today's events with time-based formatting.",
  "frontend/src/pages/Settings.tsx": "Settings page with toggles for dark mode theme and browser notification permissions, plus placeholder for cloud sync feature.",
  "frontend/src/utils/notificationHelpers.ts": "Utility functions for checking and requesting notification permissions, showing event notifications, and calculating time until events.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, dark mode support, custom animations (accordion, fade-in), safe area spacing, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document defining a mobile Calendar App with React/TypeScript frontend, Motoko backend on Internet Computer, featuring daily/weekly/monthly views, event management, reminders, dark/light mode, and bottom navigation with blue/white/purple theme."
}